{
  "home": {
    "message": {
      "title": "Welcome to my DevSecOps Portfolio!",
      "subtitle": "Showcasing my skills in Development, Security, and Operations."
    },
    "button": {
      "github": "View my project on GitHub",
      "about": "About me"
    }
  },
  "nav": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "theme": "Theme",
    "curriculum": "Curriculum"
  },
  "projects": {
    "title": "My Projects",
    "subtitle": "A selection of my work in DevSecOps, showcasing my skills in development, security, and operations.",
    "button": {
      "explore": "Explore"
    },
    "cards": {
      "website": {
        "title": "This website",
        "subtitle": "This very website you are browsing right now! Done with Vue 3 and Vuetify 3. Pure frontend goodness.",
        "text": "This is a testing project that I started to build my portfolio. I am trying to focus on a single framework and master it in order to build more complex projects in the future, while also improving my understanding of how to deploy and maintain web applications."
      },
      "dns-c": {
        "title": "DNS-C",
        "subtitle": "C project built to learn more about low-level programming and networking.",
        "text": "Inspired by Daniel Hirsch, I built a DNS client from scratch using the C language. This project helped me better understand sockets, networking protocols, and low-level programming concepts."
      },
      "blockchain-example": {
        "title": "blockchain-example",
        "subtitle": "Simple blockchain implementation in Go with concurrency.",
        "text": "Using goroutines and channels, I built a simple blockchain implementation to better understand how blockchain works under the hood. This project helped me learn more about Go’s concurrency model and data structures. It is a simple but very exciting project, and I recommend everyone to try it out."
      },
      "adocli": {
        "title": "adocli",
        "subtitle": "Azure DevOps CLI — manage your Azure DevOps resources from the command line.",
        "text": "I started this project to help myself and others manage Azure DevOps resources from the command line. It is built using Golang and the Click library. It is still in early development, but it already has some basic features implemented. Feel free to check it out and contribute!"
      }
    }
  },
  "about": {
    "title": "About me",
    "content": "My name Felipe Santos A.K.A Revz, a passionate DevSecOps engineer with a strong background in software development, cybersecurity, software architecture and IT operations.",
    "hobbies": [
      "Programming Challenges",
      "Drumming and music production",
      "Hiking and outdoor adventures",
      "Riding my bike around the city",
      "Gym and fitness",
      "Gaming"
    ],
    "revz": {
      "title": "Why Revz?",
      "content": "Back in 2011, when I was diving into the world of online gaming, I had a competitive team called Like A Boss - tag LaB. I didn't had a proper name to match the team tag,so I thought about my favorite band at the time, Avenged Sevenfold, and my favorite member, The Rev. Thus, I decided to go with LaB x ReverendYz as a tribute to him. Overtime, ReverendYz got shortened to Revz, and it stuck with me ever since."
    },
    "degrees": [
      "Bachelor's Degree in Information Systems - FESPPR (2021)",
      "Postgraduate in Cybersecurity - PUCPR (2025)"
    ]
  },
  "curriculum": {
    "title": "Professional Experience",
    "summary": "I constantly seek to expand my skills and knowledge in DevSecOps, development and architecture. Spreading the DevOps culture and promoting security practices throughout all stages of the software development lifecycle.",
    "stack": "Tech Stack",
    "current": "Current",
    "experience": {
      "vwb": {
        "position": "IT Architect",
        "description": "Leading IT architecture initiatives.",
        "highlights": [
          "Developing solution architectures for internal projects and clients",
          "Collaborating with cross-functional teams to ensure successful implementation of proposed solutions",
          "Setting up and managing local Kubernetes Cluster and AWS EKS",
          "Implementing CI/CD pipelines using GitHub Actions and Terraform for infrastructure automation"
        ]
      },
      "landis": {
        "position": "Sr DevOps Engineer",
        "description": "Leading DevOps initiatives and infrastructure management for enterprise solutions.",
        "highlights": [
          "Deploy standard environments containing GCP resources as Kubernetes, instances and storage",
          "Maintain GitLab pipelines, improving execution time and business logic",
          "Developed automation scripts with Bash, Python, and PowerShell to achieve reliable configuration",
          "Spread DevOps culture throughout the development team"
        ]
      },
      "freelancer": {
        "position": "DevOps Consultant",
        "description": "Providing DevOps consulting services for various clients.",
        "highlights": [
          "Responsible for maintaining, deploying, and automating processes",
          "Moved applications from private providers to Azure, improving dev team performance with pipelines, automation scripts, and architecture design utilizing Kubernetes and CDN"
        ]
      },
      "trimble": {
        "position": "DevOps Engineer",
        "description": "Building and maintaining platform infrastructure to support development teams.",
        "highlights": [
          "Maintained pipelines, infrastructure, and built a platform team to help developers thrive",
          "Deployed infrastructure using Terraform and Terragrunt",
          "Worked with all main cloud providers to deliver the best experience for the development team"
        ]
      },
      "arauco2": {
        "position": "Support Analyst",
        "description": "Network administration and infrastructure management.",
        "highlights": [
          "Network administrator dealing with firewall rules, network management, Wi-Fi improvement and placement projects",
          "Major network configurations related to Azure servers, preparing and segmenting Azure networking for VPN connections"
        ]
      },
      "arauco1": {
        "position": "Administrative Assistant",
        "description": "Network and telephony administration.",
        "highlights": [
          "Improved and managed telephony and network solutions",
          "Managed provider invoices and uploaded information to SAP"
        ]
      },
      "intern": {
        "position": "Intern",
        "description": "IT support and device management.",
        "highlights": [
          "Managed and fixed computers and devices. Participated actively in a project to update weighing scale software"
        ]
      }
    }
  }
}